In [2]:
import numpy as np
import pandas as pd

In [3]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [4]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [5]:
val = pd.Series([-1.2, -1.5, -1.7], index=[0,1,2])
frame2["debt"]=val
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  -1.2
1  2001    Ohio  1.7  -1.5
2  2002    Ohio  3.6  -1.7
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [6]:
frame2["debt"] = np.arange(6.)
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [7]:
frame2["eastern"] = frame2["state"] == "Ohio"
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   0.0     True
1  2001    Ohio  1.7   1.0     True
2  2002    Ohio  3.6   2.0     True
3  2001  Nevada  2.4   3.0    False
4  2002  Nevada  2.9   4.0    False
5  2003  Nevada  3.2   5.0    False

In [8]:
del frame2["eastern"]
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [9]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
             "Nevada": {2001: 2.4, 2002: 2.9}}
populations

{'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}, 'Nevada': {2001: 2.4, 2002: 2.9}}

In [10]:
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [11]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [12]:
frame2_np=frame2.to_numpy()

In [13]:
frame2_np[0][1]

'Ohio'

In [14]:
frame2["year"].unique()

array([2000, 2001, 2002, 2003])

In [15]:
frame3=frame2.reindex(index=['a','b','c','d','e','f'])
frame3

   year state  pop  debt
a   NaN   NaN  NaN   NaN
b   NaN   NaN  NaN   NaN
c   NaN   NaN  NaN   NaN
d   NaN   NaN  NaN   NaN
e   NaN   NaN  NaN   NaN
f   NaN   NaN  NaN   NaN

In [29]:
frame2.drop(index=0)
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [33]:
frame2.loc[frame2['year']>=2002]

   year   state  pop  debt
2  2002    Ohio  3.6   2.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [35]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
                   columns=list("bde"),
                   index=["Utah", "Ohio", "Texas", "Oregon"])
frame

               b         d         e
Utah    0.951217  1.627570  1.287560
Ohio    0.432550 -0.045669  0.440554
Texas  -1.013292  0.220589  2.547553
Oregon  1.622360  0.528371 -1.866187

In [36]:
def f1(x):
    return x.max() - x.min()